In [1]:
import pandas as pd

In [2]:
pd.read_csv('alumnos.csv')

       nombre  altura  peso  edad sexo
0        Hugo    1.67    60    23    h
1        Paco    1.73    83    25    h
2        Luis    1.62    70    28    h
3       Diana    1.58    58    21    m
4   Francisco    1.86    98    28    h
5      Felipe    1.79   100    26    h
6     Jacinta    1.69    62    20    m
7    Bernardo    1.60    83    31    h
8     Marisol    1.60    56    30    m
9     Facundo    1.98   112    36    h
10   Trinidad    1.72    72    21    m
11     Camila    1.63    57    26    m
12   Macarena    1.73    68    27    m
13      Diego    1.62    78    23    h
14    Gonzalo    1.58    67    22    h
15  Alejandra    1.86    74    21    m
16   Fernando    1.79    93    27    h
17   Carolina    1.60    63    28    m
18    Vicente    1.98   102    31    h
19   Benjamín    1.72    78    36    h
20     Gloria    1.58    65    23    m

In [3]:
df = pd.read_csv('alumnos.csv')

In [4]:
df.head()

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [5]:
df.head(1)

  nombre  altura  peso  edad sexo
0   Hugo    1.67    60    23    h

In [6]:
df.columns

Index(['nombre', 'altura', 'peso', 'edad', 'sexo'], dtype='object')

In [7]:
df['altura']

0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58
Name: altura, dtype: float64

In [8]:
type(df['altura'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.iloc[1,:]

nombre    Paco
altura    1.73
peso        83
edad        25
sexo         h
Name: 1, dtype: object

In [11]:
df.loc[1,:]

nombre    Paco
altura    1.73
peso        83
edad        25
sexo         h
Name: 1, dtype: object

In [12]:
type(df.loc[1,:])

pandas.core.series.Series

In [13]:
df['sexo'].index

RangeIndex(start=0, stop=21, step=1)

In [14]:
df['sexo'].values

array(['h', 'h', 'h', 'm', 'h', 'h', 'm', 'h', 'm', 'h', 'm', 'm', 'm',
       'h', 'h', 'm', 'h', 'm', 'h', 'h', 'm'], dtype=object)

In [15]:
peso_alumnos = df['peso']

In [16]:
peso_alumnos

0      60
1      83
2      70
3      58
4      98
5     100
6      62
7      83
8      56
9     112
10     72
11     57
12     68
13     78
14     67
15     74
16     93
17     63
18    102
19     78
20     65
Name: peso, dtype: int64

In [17]:
type(peso_alumnos)

pandas.core.series.Series

In [18]:
peso_alumnos[:3]

0    60
1    83
2    70
Name: peso, dtype: int64

In [19]:
peso_alumnos[2:6]

2     70
3     58
4     98
5    100
Name: peso, dtype: int64

In [20]:
media_nativa = sum(df['altura']) / len(df['altura'])

In [21]:
media_pandas = df['altura'].mean()

In [22]:
import numpy as np

In [23]:
media_numpy = np.mean(df['altura'])

In [24]:
for i in [media_nativa, media_pandas, media_numpy]:
    print(i)

1.7109523809523806
1.7109523809523806
1.7109523809523806

In [25]:
media_nativa == media_pandas

True

In [26]:
media_nativa == media_numpy

True

In [27]:
from scipy import stats

In [28]:
moda = stats.mode(df['altura'])

In [29]:
moda

ModeResult(mode=array([1.58]), count=array([3]))

In [30]:
mediana_pandas = df['altura'].median()
print(mediana_pandas)

1.69

In [31]:
mediana_numpy = np.median(df['altura'])
print(mediana_numpy)

1.69

In [32]:
varianza_pandas = df['altura'].var()
print(varianza_pandas)

0.01580904761904761

In [33]:
varianza_numpy = np.var(df['altura'])
print(varianza_numpy)

0.015056235827664391

In [34]:
varianza_pandas == varianza_numpy

False

In [35]:
df['altura'].values.var()

0.015056235827664395

In [36]:
df['altura'].values.var() == df['altura'].var()

False

In [37]:
df['altura'].var(ddof=0) == df['altura'].values.var(ddof=0)

False

In [38]:
df['altura'].values.var(ddof=1) == np.var(df['altura'], ddof=1)

False

In [39]:
np.var(df['altura'], ddof=1)

0.01580904761904761

In [40]:
np.var(df['altura'])

0.015056235827664391

In [41]:
df['altura'].std()

0.1257340352452255

In [42]:
np.std(df['altura'])

0.12270385416792902

In [43]:
for i in df['altura']:
    print(i, 'es del tipo ', type(i))

1.67 es del tipo  <class 'float'>
1.73 es del tipo  <class 'float'>
1.62 es del tipo  <class 'float'>
1.58 es del tipo  <class 'float'>
1.86 es del tipo  <class 'float'>
1.79 es del tipo  <class 'float'>
1.69 es del tipo  <class 'float'>
1.6 es del tipo  <class 'float'>
1.6 es del tipo  <class 'float'>
1.98 es del tipo  <class 'float'>
1.72 es del tipo  <class 'float'>
1.63 es del tipo  <class 'float'>
1.73 es del tipo  <class 'float'>
1.62 es del tipo  <class 'float'>
1.58 es del tipo  <class 'float'>
1.86 es del tipo  <class 'float'>
1.79 es del tipo  <class 'float'>
1.6 es del tipo  <class 'float'>
1.98 es del tipo  <class 'float'>
1.72 es del tipo  <class 'float'>
1.58 es del tipo  <class 'float'>

In [44]:
for i in df['altura']:
    print(i + 1.0)

2.67
2.73
2.62
2.58
2.8600000000000003
2.79
2.69
2.6
2.6
2.98
2.7199999999999998
2.63
2.73
2.62
2.58
2.8600000000000003
2.79
2.6
2.98
2.7199999999999998
2.58

In [45]:
for i in df['altura'].index:
    if i % 2 == 0:
        print(i, df['altura'][i])

0 1.67
2 1.62
4 1.86
6 1.69
8 1.6
10 1.72
12 1.73
14 1.58
16 1.79
18 1.98
20 1.58

In [46]:
mean_peso = df['peso'].mean()

In [47]:
for i in df['peso']:
    if i > mean_peso:
        print(i, "tiene un peso sobre el promedio")
    else:
        print(i, "tiene un peso bajo el promedio")

60 tiene un peso bajo el promedio
83 tiene un peso sobre el promedio
70 tiene un peso bajo el promedio
58 tiene un peso bajo el promedio
98 tiene un peso sobre el promedio
100 tiene un peso sobre el promedio
62 tiene un peso bajo el promedio
83 tiene un peso sobre el promedio
56 tiene un peso bajo el promedio
112 tiene un peso sobre el promedio
72 tiene un peso bajo el promedio
57 tiene un peso bajo el promedio
68 tiene un peso bajo el promedio
78 tiene un peso sobre el promedio
67 tiene un peso bajo el promedio
74 tiene un peso bajo el promedio
93 tiene un peso sobre el promedio
63 tiene un peso bajo el promedio
102 tiene un peso sobre el promedio
78 tiene un peso sobre el promedio
65 tiene un peso bajo el promedio

In [48]:
mean_peso

76.14285714285714

In [49]:
for i in df:
    print(i)

nombre
altura
peso
edad
sexo

In [50]:
df.head()

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [51]:
for colname, serie in df.iteritems():
    print(colname, serie.values)

nombre ['Hugo' 'Paco' 'Luis' 'Diana' 'Francisco' 'Felipe' 'Jacinta' 'Bernardo'
 'Marisol' 'Facundo' 'Trinidad' 'Camila' 'Macarena' 'Diego' 'Gonzalo'
 'Alejandra' 'Fernando' 'Carolina' 'Vicente' 'Benjamín' 'Gloria']
altura [1.67 1.73 1.62 1.58 1.86 1.79 1.69 1.6  1.6  1.98 1.72 1.63 1.73 1.62
 1.58 1.86 1.79 1.6  1.98 1.72 1.58]
peso [ 60  83  70  58  98 100  62  83  56 112  72  57  68  78  67  74  93  63
 102  78  65]
edad [23 25 28 21 28 26 20 31 30 36 21 26 27 23 22 21 27 28 31 36 23]
sexo ['h' 'h' 'h' 'm' 'h' 'h' 'm' 'h' 'm' 'h' 'm' 'm' 'm' 'h' 'h' 'm' 'h' 'm'
 'h' 'h' 'm']

In [52]:
for colname, serie in df.iteritems():
    if serie.dtype == 'object':
        print(colname, 'es un objeto')
    else:
        print('La media de', colname, 'es de', serie.mean())

nombre es un objeto
La media de altura es de 1.7109523809523806
La media de peso es de 76.14285714285714
La media de edad es de 26.333333333333332
sexo es un objeto

In [53]:
for rowname, rowserie in df.iterrows():
    if rowserie['sexo'] == 'm':
        print(rowserie['nombre'])

Diana
Jacinta
Marisol
Trinidad
Camila
Macarena
Alejandra
Carolina
Gloria

In [54]:
df.iloc[0].values

array(['Hugo', 1.67, 60, 23, 'h'], dtype=object)

In [55]:
df.iloc[0].index

Index(['nombre', 'altura', 'peso', 'edad', 'sexo'], dtype='object')

In [56]:
df['peso'] < mean_peso

0      True
1     False
2      True
3      True
4     False
5     False
6      True
7     False
8      True
9     False
10     True
11     True
12     True
13    False
14     True
15     True
16    False
17     True
18    False
19    False
20     True
Name: peso, dtype: bool

In [57]:
df['nombre']

0          Hugo
1          Paco
2          Luis
3         Diana
4     Francisco
5        Felipe
6       Jacinta
7      Bernardo
8       Marisol
9       Facundo
10     Trinidad
11       Camila
12     Macarena
13        Diego
14      Gonzalo
15    Alejandra
16     Fernando
17     Carolina
18      Vicente
19     Benjamín
20       Gloria
Name: nombre, dtype: object

In [58]:
df['sexo'] == 'm'

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8      True
9     False
10     True
11     True
12     True
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20     True
Name: sexo, dtype: bool

In [59]:
df[df['sexo'] == 'm']['nombre']

3         Diana
6       Jacinta
8       Marisol
10     Trinidad
11       Camila
12     Macarena
15    Alejandra
17     Carolina
20       Gloria
Name: nombre, dtype: object

In [60]:
contador_male = 0

for rowname, rowseries in df.iterrows():
    if rowseries['sexo'] == 'h':
        contador_male += rowseries['peso']

print(contador_male / 12)

85.33333333333333

In [61]:
df['sexo'].value_counts()

h    12
m     9
Name: sexo, dtype: int64

In [62]:
df[df['sexo'] == 'm']['peso'].mean()

63.888888888888886

In [63]:
contador_female = 0

for rowname, rowseries in df.iterrows():
    if rowseries['sexo'] == 'm':
        contador_female += rowseries['peso']

print(contador_female / 9)

63.888888888888886

In [64]:
mean_female_below_height = 0
count_female_n = 0

for rowname, rowseries in df.iterrows():
    if rowseries['sexo'] == 'm' and rowseries['altura'] < df['altura'].mean():
        mean_female_below_height += rowseries['peso']
        count_female_n += 1

In [65]:
mean_female_below_height / count_female_n

60.166666666666664

In [66]:
count_female_n

6

In [67]:
df['nombre'].dtype is bool

False

In [68]:
df[['altura']]

    altura
0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58

In [70]:
df.loc[:, ['altura']]

    altura
0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58

In [72]:
df.columns

Index(['nombre', 'altura', 'peso', 'edad', 'sexo'], dtype='object')

In [73]:
df['peso'] < 70

0      True
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8      True
9     False
10    False
11     True
12     True
13    False
14     True
15    False
16    False
17     True
18    False
19    False
20     True
Name: peso, dtype: bool

In [75]:
df[df['peso'] < 70]['nombre']

0         Hugo
3        Diana
6      Jacinta
8      Marisol
11      Camila
12    Macarena
14     Gonzalo
17    Carolina
20      Gloria
Name: nombre, dtype: object

In [78]:
df[(df['peso'] < 70) & (df['altura'] > 1) & (df['sexo'] == 'm')]

      nombre  altura  peso  edad sexo
3      Diana    1.58    58    21    m
6    Jacinta    1.69    62    20    m
8    Marisol    1.60    56    30    m
11    Camila    1.63    57    26    m
12  Macarena    1.73    68    27    m
17  Carolina    1.60    63    28    m
20    Gloria    1.58    65    23    m